frostfire45/Codewarrior/Lib/hc12c/include/mc9s12vr64.h
#define IVBR_IVB_ADDR0_MASK             1U
#define IVBR_IVB_ADDR1_MASK             2U
#define IVBR_IVB_ADDR2_MASK             4U
#define IVBR_IVB_ADDR3_MASK             8U
#define IVBR_IVB_ADDR4_MASK             16U
#define IVBR_IVB_ADDR5_MASK             32U
#define IVBR_IVB_ADDR6_MASK             64U
#define IVBR_IVB_ADDR7_MASK             128U


/*** HSDR - Port HS Data Register; 0x00000140 ***/
typedef union {
  byte Byte;
  struct {
    byte HSDR0       :1;                                       /* Port HS Data Bit 0 */
    byte HSDR1       :1;                                       /* Port HS Data Bit 1 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpHSDR :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} HSDRSTR;
extern volatile HSDRSTR _HSDR @(REG_BASE + 0x00000140UL);
#define HSDR                            _HSDR.Byte
#define HSDR_HSDR0                      _HSDR.Bits.HSDR0
#define HSDR_HSDR1                      _HSDR.Bits.HSDR1
#define HSDR_HSDR                       _HSDR.MergedBits.grpHSDR

#define HSDR_HSDR0_MASK                 1U
#define HSDR_HSDR1_MASK                 2U
#define HSDR_HSDR_MASK                  3U
#define HSDR_HSDR_BITNUM                0U


/*** HSCR - HSDRV Configuration Register; 0x00000141 ***/
typedef union {
  byte Byte;
  struct {
    byte HSE0        :1;                                       /* HSDRV Enable Bit 0 */
    byte HSE1        :1;                                       /* HSDRV Enable Bit 1 */
    byte HSOLE0      :1;                                       /* HSDRV High-Load resistance Open-Load Detection Enable Bit 0 */
    byte HSOLE1      :1;                                       /* HSDRV High-Load resistance Open-Load Detection Enable Bit 1 */
    byte HSOCME0     :1;                                       /* HSDRV Over-Current Mask Enable Bit0 */
    byte HSOCME1     :1;                                       /* HSDRV Over-Current Mask Enable Bit1 */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpHSE  :2;
    byte grpHSOLE :2;
    byte grpHSOCME :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} HSCRSTR;
extern volatile HSCRSTR _HSCR @(REG_BASE + 0x00000141UL);
#define HSCR                            _HSCR.Byte
#define HSCR_HSE0                       _HSCR.Bits.HSE0
#define HSCR_HSE1                       _HSCR.Bits.HSE1
#define HSCR_HSOLE0                     _HSCR.Bits.HSOLE0
#define HSCR_HSOLE1                     _HSCR.Bits.HSOLE1
#define HSCR_HSOCME0                    _HSCR.Bits.HSOCME0
#define HSCR_HSOCME1                    _HSCR.Bits.HSOCME1
#define HSCR_HSE                        _HSCR.MergedBits.grpHSE
#define HSCR_HSOLE                      _HSCR.MergedBits.grpHSOLE
#define HSCR_HSOCME                     _HSCR.MergedBits.grpHSOCME

#define HSCR_HSE0_MASK                  1U
#define HSCR_HSE1_MASK                  2U
#define HSCR_HSOLE0_MASK                4U
#define HSCR_HSOLE1_MASK                8U
#define HSCR_HSOCME0_MASK               16U
#define HSCR_HSOCME1_MASK               32U
#define HSCR_HSE_MASK                   3U
#define HSCR_HSE_BITNUM                 0U
#define HSCR_HSOLE_MASK                 12U
#define HSCR_HSOLE_BITNUM               2U
#define HSCR_HSOCME_MASK                48U
#define HSCR_HSOCME_BITNUM              4U


/*** HSSR - HSDRV Open Load Status Register; 0x00000145 ***/
typedef union {
  byte Byte;
  struct {
    byte HSOL0       :1;                                       /* HSDRV Open-Load Status Bit 0 */
    byte HSOL1       :1;                                       /* HSDRV Open-Load Status Bit 1 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpHSOL :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} HSSRSTR;
extern volatile HSSRSTR _HSSR @(REG_BASE + 0x00000145UL);
#define HSSR                            _HSSR.Byte
#define HSSR_HSOL0                      _HSSR.Bits.HSOL0
#define HSSR_HSOL1                      _HSSR.Bits.HSOL1
#define HSSR_HSOL                       _HSSR.MergedBits.grpHSOL

#define HSSR_HSOL0_MASK                 1U
#define HSSR_HSOL1_MASK                 2U
#define HSSR_HSOL_MASK                  3U
#define HSSR_HSOL_BITNUM                0U


/*** HSIE - HSDRV Over Current Interrupt Enable Register; 0x00000146 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte HSOCIE      :1;                                       /* HSDRV Over-Current Interrupt Enable */
  } Bits;
} HSIESTR;
extern volatile HSIESTR _HSIE @(REG_BASE + 0x00000146UL);
#define HSIE                            _HSIE.Byte
#define HSIE_HSOCIE                     _HSIE.Bits.HSOCIE

#define HSIE_HSOCIE_MASK                128U


/*** HSIF - HSDRV Over Current Interrupt Flag Register; 0x00000147 ***/
typedef union {
  byte Byte;
  struct {
    byte HSOCIF0     :1;                                       /* HSDRV Over-Current Interrupt Flag 0 */
    byte HSOCIF1     :1;                                       /* HSDRV Over-Current Interrupt Flag 1 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpHSOCIF :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} HSIFSTR;
extern volatile HSIFSTR _HSIF @(REG_BASE + 0x00000147UL);
#define HSIF                            _HSIF.Byte
#define HSIF_HSOCIF0                    _HSIF.Bits.HSOCIF0
#define HSIF_HSOCIF1                    _HSIF.Bits.HSOCIF1
#define HSIF_HSOCIF                     _HSIF.MergedBits.grpHSOCIF

#define HSIF_HSOCIF0_MASK               1U
#define HSIF_HSOCIF1_MASK               2U
#define HSIF_HSOCIF_MASK                3U
#define HSIF_HSOCIF_BITNUM              0U


/*** LSDR - Port LS Data Register; 0x00000150 ***/
typedef union {
  byte Byte;
  struct {
    byte LSDR0       :1;                                       /* Port LS Data Bit 0 */
    byte LSDR1       :1;                                       /* Port LS Data Bit 1 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpLSDR :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} LSDRSTR;
extern volatile LSDRSTR _LSDR @(REG_BASE + 0x00000150UL);
#define LSDR                            _LSDR.Byte
#define LSDR_LSDR0                      _LSDR.Bits.LSDR0
#define LSDR_LSDR1                      _LSDR.Bits.LSDR1
#define LSDR_LSDR                       _LSDR.MergedBits.grpLSDR

