frostfire45/Codewarrior/Lib/hc12c/include/mc9s12vr64.h
extern volatile PTI1ADSTR _PTI1AD @(REG_BASE + 0x00000273UL);
#define PTI1AD                          _PTI1AD.Byte
#define PTI1AD_PTI1AD0                  _PTI1AD.Bits.PTI1AD0
#define PTI1AD_PTI1AD1                  _PTI1AD.Bits.PTI1AD1
#define PTI1AD_PTI1AD2                  _PTI1AD.Bits.PTI1AD2
#define PTI1AD_PTI1AD3                  _PTI1AD.Bits.PTI1AD3
#define PTI1AD_PTI1AD4                  _PTI1AD.Bits.PTI1AD4
#define PTI1AD_PTI1AD5                  _PTI1AD.Bits.PTI1AD5
#define PTI1AD_PTI1AD                   _PTI1AD.MergedBits.grpPTI1AD

#define PTI1AD_PTI1AD0_MASK             1U
#define PTI1AD_PTI1AD1_MASK             2U
#define PTI1AD_PTI1AD2_MASK             4U
#define PTI1AD_PTI1AD3_MASK             8U
#define PTI1AD_PTI1AD4_MASK             16U
#define PTI1AD_PTI1AD5_MASK             32U
#define PTI1AD_PTI1AD_MASK              63U
#define PTI1AD_PTI1AD_BITNUM            0U


/*** DDR1AD - Port ADL Data Direction Register; 0x00000275 ***/
typedef union {
  byte Byte;
  struct {
    byte DDR1AD0     :1;                                       /* Port AD data direction bit 0 */
    byte DDR1AD1     :1;                                       /* Port AD data direction bit 1 */
    byte DDR1AD2     :1;                                       /* Port AD data direction bit 2 */
    byte DDR1AD3     :1;                                       /* Port AD data direction bit 3 */
    byte DDR1AD4     :1;                                       /* Port AD data direction bit 4 */
    byte DDR1AD5     :1;                                       /* Port AD data direction bit 5 */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpDDR1AD :6;
    byte         :1;
    byte         :1;
  } MergedBits;
} DDR1ADSTR;
extern volatile DDR1ADSTR _DDR1AD @(REG_BASE + 0x00000275UL);
#define DDR1AD                          _DDR1AD.Byte
#define DDR1AD_DDR1AD0                  _DDR1AD.Bits.DDR1AD0
#define DDR1AD_DDR1AD1                  _DDR1AD.Bits.DDR1AD1
#define DDR1AD_DDR1AD2                  _DDR1AD.Bits.DDR1AD2
#define DDR1AD_DDR1AD3                  _DDR1AD.Bits.DDR1AD3
#define DDR1AD_DDR1AD4                  _DDR1AD.Bits.DDR1AD4
#define DDR1AD_DDR1AD5                  _DDR1AD.Bits.DDR1AD5
#define DDR1AD_DDR1AD                   _DDR1AD.MergedBits.grpDDR1AD

#define DDR1AD_DDR1AD0_MASK             1U
#define DDR1AD_DDR1AD1_MASK             2U
#define DDR1AD_DDR1AD2_MASK             4U
#define DDR1AD_DDR1AD3_MASK             8U
#define DDR1AD_DDR1AD4_MASK             16U
#define DDR1AD_DDR1AD5_MASK             32U
#define DDR1AD_DDR1AD_MASK              63U
#define DDR1AD_DDR1AD_BITNUM            0U


/*** PER1AD - Port ADL Pull Up Enable Register; 0x00000279 ***/
typedef union {
  byte Byte;
  struct {
    byte PER1AD0     :1;                                       /* Port ADL pull up enable bit 0 */
    byte PER1AD1     :1;                                       /* Port ADL pull up enable bit 1 */
    byte PER1AD2     :1;                                       /* Port ADL pull up enable bit 2 */
    byte PER1AD3     :1;                                       /* Port ADL pull up enable bit 3 */
    byte PER1AD4     :1;                                       /* Port ADL pull up enable bit 4 */
    byte PER1AD5     :1;                                       /* Port ADL pull up enable bit 5 */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPER1AD :6;
    byte         :1;
    byte         :1;
  } MergedBits;
} PER1ADSTR;
extern volatile PER1ADSTR _PER1AD @(REG_BASE + 0x00000279UL);
#define PER1AD                          _PER1AD.Byte
#define PER1AD_PER1AD0                  _PER1AD.Bits.PER1AD0
#define PER1AD_PER1AD1                  _PER1AD.Bits.PER1AD1
#define PER1AD_PER1AD2                  _PER1AD.Bits.PER1AD2
#define PER1AD_PER1AD3                  _PER1AD.Bits.PER1AD3
#define PER1AD_PER1AD4                  _PER1AD.Bits.PER1AD4
#define PER1AD_PER1AD5                  _PER1AD.Bits.PER1AD5
#define PER1AD_PER1AD                   _PER1AD.MergedBits.grpPER1AD

#define PER1AD_PER1AD0_MASK             1U
#define PER1AD_PER1AD1_MASK             2U
#define PER1AD_PER1AD2_MASK             4U
#define PER1AD_PER1AD3_MASK             8U
#define PER1AD_PER1AD4_MASK             16U
#define PER1AD_PER1AD5_MASK             32U
#define PER1AD_PER1AD_MASK              63U
#define PER1AD_PER1AD_BITNUM            0U


/*** PPS1AD - Port ADL Polarity Select Register; 0x0000027B ***/
typedef union {
  byte Byte;
  struct {
    byte PPS1AD0     :1;                                       /* Port ADL Polarity Select Bit 0 */
    byte PPS1AD1     :1;                                       /* Port ADL Polarity Select Bit 1 */
    byte PPS1AD2     :1;                                       /* Port ADL Polarity Select Bit 2 */
    byte PPS1AD3     :1;                                       /* Port ADL Polarity Select Bit 3 */
    byte PPS1AD4     :1;                                       /* Port ADL Polarity Select Bit 4 */
    byte PPS1AD5     :1;                                       /* Port ADL Polarity Select Bit 5 */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPPS1AD :6;
    byte         :1;
    byte         :1;
  } MergedBits;
} PPS1ADSTR;
extern volatile PPS1ADSTR _PPS1AD @(REG_BASE + 0x0000027BUL);
#define PPS1AD                          _PPS1AD.Byte
#define PPS1AD_PPS1AD0                  _PPS1AD.Bits.PPS1AD0
#define PPS1AD_PPS1AD1                  _PPS1AD.Bits.PPS1AD1
#define PPS1AD_PPS1AD2                  _PPS1AD.Bits.PPS1AD2
#define PPS1AD_PPS1AD3                  _PPS1AD.Bits.PPS1AD3
#define PPS1AD_PPS1AD4                  _PPS1AD.Bits.PPS1AD4
#define PPS1AD_PPS1AD5                  _PPS1AD.Bits.PPS1AD5
#define PPS1AD_PPS1AD                   _PPS1AD.MergedBits.grpPPS1AD

#define PPS1AD_PPS1AD0_MASK             1U
#define PPS1AD_PPS1AD1_MASK             2U
#define PPS1AD_PPS1AD2_MASK             4U
#define PPS1AD_PPS1AD3_MASK             8U
#define PPS1AD_PPS1AD4_MASK             16U
#define PPS1AD_PPS1AD5_MASK             32U
#define PPS1AD_PPS1AD_MASK              63U
#define PPS1AD_PPS1AD_BITNUM            0U


/*** PIE1AD - Port ADL Interrupt Enable Register; 0x0000027D ***/
typedef union {
  byte Byte;
  struct {
    byte PIE1AD0     :1;                                       /* Port ADL Interrupt Enable Bit 0 */
    byte PIE1AD1     :1;                                       /* Port ADL Interrupt Enable Bit 1 */
    byte PIE1AD2     :1;                                       /* Port ADL Interrupt Enable Bit 2 */
    byte PIE1AD3     :1;                                       /* Port ADL Interrupt Enable Bit 3 */
    byte PIE1AD4     :1;                                       /* Port ADL Interrupt Enable Bit 4 */
    byte PIE1AD5     :1;                                       /* Port ADL Interrupt Enable Bit 5 */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPIE1AD :6;
    byte         :1;
    byte         :1;
  } MergedBits;
} PIE1ADSTR;
extern volatile PIE1ADSTR _PIE1AD @(REG_BASE + 0x0000027DUL);
#define PIE1AD                          _PIE1AD.Byte
#define PIE1AD_PIE1AD0                  _PIE1AD.Bits.PIE1AD0
#define PIE1AD_PIE1AD1                  _PIE1AD.Bits.PIE1AD1
#define PIE1AD_PIE1AD2                  _PIE1AD.Bits.PIE1AD2
#define PIE1AD_PIE1AD3                  _PIE1AD.Bits.PIE1AD3
#define PIE1AD_PIE1AD4                  _PIE1AD.Bits.PIE1AD4
#define PIE1AD_PIE1AD5                  _PIE1AD.Bits.PIE1AD5
#define PIE1AD_PIE1AD                   _PIE1AD.MergedBits.grpPIE1AD

#define PIE1AD_PIE1AD0_MASK             1U
#define PIE1AD_PIE1AD1_MASK             2U
#define PIE1AD_PIE1AD2_MASK             4U
#define PIE1AD_PIE1AD3_MASK             8U
#define PIE1AD_PIE1AD4_MASK             16U
#define PIE1AD_PIE1AD5_MASK             32U
#define PIE1AD_PIE1AD_MASK              63U
#define PIE1AD_PIE1AD_BITNUM            0U


/*** PIF1AD - Port ADL Interrupt Flag Register; 0x0000027F ***/
typedef union {
  byte Byte;
  struct {
    byte PIF1AD0     :1;                                       /* Port ADL Bit 0 */
    byte PIF1AD1     :1;                                       /* Port ADL Bit 1 */
    byte PIF1AD2     :1;                                       /* Port ADL Bit 2 */
    byte PIF1AD3     :1;                                       /* Port ADL Bit 3 */
    byte PIF1AD4     :1;                                       /* Port ADL Bit 4 */
    byte PIF1AD5     :1;                                       /* Port ADL Bit 5 */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPIF1AD :6;
    byte         :1;
    byte         :1;
  } MergedBits;
} PIF1ADSTR;
extern volatile PIF1ADSTR _PIF1AD @(REG_BASE + 0x0000027FUL);
#define PIF1AD                          _PIF1AD.Byte
#define PIF1AD_PIF1AD0                  _PIF1AD.Bits.PIF1AD0
#define PIF1AD_PIF1AD1                  _PIF1AD.Bits.PIF1AD1
#define PIF1AD_PIF1AD2                  _PIF1AD.Bits.PIF1AD2
#define PIF1AD_PIF1AD3                  _PIF1AD.Bits.PIF1AD3
#define PIF1AD_PIF1AD4                  _PIF1AD.Bits.PIF1AD4
#define PIF1AD_PIF1AD5                  _PIF1AD.Bits.PIF1AD5
#define PIF1AD_PIF1AD                   _PIF1AD.MergedBits.grpPIF1AD

#define PIF1AD_PIF1AD0_MASK             1U
#define PIF1AD_PIF1AD1_MASK             2U
#define PIF1AD_PIF1AD2_MASK             4U
#define PIF1AD_PIF1AD3_MASK             8U
#define PIF1AD_PIF1AD4_MASK             16U
#define PIF1AD_PIF1AD5_MASK             32U
#define PIF1AD_PIF1AD_MASK              63U
#define PIF1AD_PIF1AD_BITNUM            0U


/*** CPMUHTCTL - High Temperature Control Register; 0x000002F0 ***/
typedef union {
  byte Byte;
  struct {
    byte HTIF        :1;                                       /* High Temperature Interrupt Flag */
    byte HTIE        :1;                                       /* High Temperature Interrupt Enable Bit */
    byte HTDS        :1;                                       /* High Temperature Detect Status Bi */
    byte HTE         :1;                                       /* High Temperature Enable Bit */
    byte             :1; 
    byte VSEL        :1;                                       /* Voltage Access Select Bit */
    byte             :1; 
    byte             :1; 
  } Bits;
} CPMUHTCTLSTR;
extern volatile CPMUHTCTLSTR _CPMUHTCTL @(REG_BASE + 0x000002F0UL);
#define CPMUHTCTL                       _CPMUHTCTL.Byte
#define CPMUHTCTL_HTIF                  _CPMUHTCTL.Bits.HTIF
#define CPMUHTCTL_HTIE                  _CPMUHTCTL.Bits.HTIE
#define CPMUHTCTL_HTDS                  _CPMUHTCTL.Bits.HTDS
#define CPMUHTCTL_HTE                   _CPMUHTCTL.Bits.HTE
#define CPMUHTCTL_VSEL                  _CPMUHTCTL.Bits.VSEL

#define CPMUHTCTL_HTIF_MASK             1U
#define CPMUHTCTL_HTIE_MASK             2U
#define CPMUHTCTL_HTDS_MASK             4U
#define CPMUHTCTL_HTE_MASK              8U
#define CPMUHTCTL_VSEL_MASK             32U


