frostfire45/Codewarrior/Lib/hc12c/include/mc9s12vr64.h
  /* Watchdog reset macro */
#ifndef __RESET_WATCHDOG
#ifdef _lint
  #define __RESET_WATCHDOG()  /* empty */
#else
  #define __RESET_WATCHDOG() (void)(CPMUARMCOP = 0x55U, CPMUARMCOP = 0xAAU)
#endif
#endif /* __RESET_WATCHDOG */


/***********************************************/
/**   D E P R E C I A T E D   S Y M B O L S   **/
/***********************************************/
/* --------------------------------------------------------------------------- */
/* The following symbols were removed, because they were invalid or irrelevant */
/* --------------------------------------------------------------------------- */



/* **** 30.3.2011 10:50:14 */

#define HSSR_HS0OL                       HSSR_HSOL0
#define HSSR_HS1OL                       HSSR_HSOL1
#define HSSR_HS0OL_MASK                  HSSR_HSOL0_MASK
#define HSSR_HS1OL_MASK                  HSSR_HSOL1_MASK
#define HSIF_HS0OCIF                     HSIF_HSOCIF0
#define HSIF_HS1OCIF                     HSIF_HSOCIF1
#define HSIF_HS0OCIF_MASK                HSIF_HSOCIF0_MASK
#define HSIF_HS1OCIF_MASK                HSIF_HSOCIF1_MASK
#define LSSR_LS0OL                       LSSR_LSOL0
#define LSSR_LS1OL                       LSSR_LSOL1
#define LSSR_LS0OL_MASK                  LSSR_LSOL0_MASK
#define LSSR_LS1OL_MASK                  LSSR_LSOL1_MASK
#define LSIF_LS0OCIF                     LSIF_LSOCIF0
#define LSIF_LS1OCIF                     LSIF_LSOCIF1
#define LSIF_LS0OCIF_MASK                LSIF_LSOCIF0_MASK
#define LSIF_LS1OCIF_MASK                LSIF_LSOCIF1_MASK


/* **** 30.6.2011 15:35:18 */

#define PWME_PWME                        This_symb_has_been_depreciated
#define PWME_PWME_MASK                   This_symb_has_been_depreciated
#define PWME_PWME_BITNUM                 This_symb_has_been_depreciated
#define PWMPOL_PPOL                      This_symb_has_been_depreciated
#define PWMPOL_PPOL_MASK                 This_symb_has_been_depreciated
#define PWMPOL_PPOL_BITNUM               This_symb_has_been_depreciated
#define PWMCLK_PCLK                      This_symb_has_been_depreciated
#define PWMCLK_PCLK_MASK                 This_symb_has_been_depreciated
#define PWMCLK_PCLK_BITNUM               This_symb_has_been_depreciated
#define PWMCAE_CAE                       This_symb_has_been_depreciated
#define PWMCAE_CAE_MASK                  This_symb_has_been_depreciated
#define PWMCAE_CAE_BITNUM                This_symb_has_been_depreciated
#define PWMCLKAB_PCLKAB                  This_symb_has_been_depreciated
#define PWMCLKAB_PCLKAB_MASK             This_symb_has_been_depreciated
#define PWMCLKAB_PCLKAB_BITNUM           This_symb_has_been_depreciated
#define PTTRR0                           MODRR0
#define PTTRR0_PTTRR00                   MODRR0_MODRR00
#define PTTRR0_PTTRR01                   MODRR0_MODRR01
#define PTTRR0_PTTRR02                   MODRR0_MODRR02
#define PTTRR0_PTTRR03                   MODRR0_MODRR03
#define PTTRR0_PTTRR04                   MODRR0_MODRR04
#define PTTRR0_PTTRR05                   MODRR0_MODRR05
#define PTTRR0_PTTRR06                   MODRR0_MODRR06
#define PTTRR0_PTTRR07                   MODRR0_MODRR07
#define PTTRR_ARR                        MODRR_ARR
#define PTTRR0_PTTRR00_MASK              MODRR0_MODRR00_MASK
#define PTTRR0_PTTRR01_MASK              MODRR0_MODRR01_MASK
#define PTTRR0_PTTRR02_MASK              MODRR0_MODRR02_MASK
#define PTTRR0_PTTRR03_MASK              MODRR0_MODRR03_MASK
#define PTTRR0_PTTRR04_MASK              MODRR0_MODRR04_MASK
#define PTTRR0_PTTRR05_MASK              MODRR0_MODRR05_MASK
#define PTTRR0_PTTRR06_MASK              MODRR0_MODRR06_MASK
#define PTTRR0_PTTRR07_MASK              MODRR0_MODRR07_MASK
#define PTTRR1                           MODRR1
#define PTTRR1_PTTRR14                   MODRR1_MODRR14
#define PTTRR1_PTTRR15                   MODRR1_MODRR15
#define PTTRR1_PTTRR_14                  MODRR1_MODRR_14
#define PTTRR1_PTTRR                     MODRR1_MODRR
#define PTTRR1_PTTRR14_MASK              MODRR1_MODRR14_MASK
#define PTTRR1_PTTRR15_MASK              MODRR1_MODRR15_MASK
#define PTTRR1_PTTRR_14_MASK             MODRR1_MODRR_14_MASK
#define PTTRR1_PTTRR_14_BITNUM           MODRR1_MODRR_14_BITNUM
#define PTTRR                            MODRR
#define PTTRR_PTTRR00                    MODRR_MODRR00
#define PTTRR_PTTRR01                    MODRR_MODRR01
#define PTTRR_PTTRR02                    MODRR_MODRR02
#define PTTRR_PTTRR03                    MODRR_MODRR03
#define PTTRR_PTTRR04                    MODRR_MODRR04
#define PTTRR_PTTRR05                    MODRR_MODRR05
#define PTTRR_PTTRR06                    MODRR_MODRR06
#define PTTRR_PTTRR07                    MODRR_MODRR07
#define PTTRR_PTTRR14                    MODRR_MODRR14
#define PTTRR_PTTRR15                    MODRR_MODRR15
#define PTTRR_PTTRR0                     MODRR_MODRR0
#define PTTRR_PTTRR_14                   MODRR_MODRR_14
#define PTTRR_PTTRR00_MASK               MODRR_MODRR00_MASK
#define PTTRR_PTTRR01_MASK               MODRR_MODRR01_MASK
#define PTTRR_PTTRR02_MASK               MODRR_MODRR02_MASK
#define PTTRR_PTTRR03_MASK               MODRR_MODRR03_MASK
#define PTTRR_PTTRR04_MASK               MODRR_MODRR04_MASK
#define PTTRR_PTTRR05_MASK               MODRR_MODRR05_MASK
#define PTTRR_PTTRR06_MASK               MODRR_MODRR06_MASK
#define PTTRR_PTTRR07_MASK               MODRR_MODRR07_MASK
#define PTTRR_PTTRR14_MASK               MODRR_MODRR14_MASK
#define PTTRR_PTTRR15_MASK               MODRR_MODRR15_MASK
#define PTTRR_PTTRR0_MASK                MODRR_MODRR0_MASK
#define PTTRR_PTTRR0_BITNUM              MODRR_MODRR0_BITNUM
#define PTTRR_PTTRR_14_MASK              MODRR_MODRR_14_MASK
#define PTTRR_PTTRR_14_BITNUM            MODRR_MODRR_14_BITNUM


/* **** 11/8/2011 1:07:46 PM */

#define PTSRR                            MODRR2
#define PTSRR_PTSRR0                     MODRR2_MODRR20
#define PTSRR_PTSRR1                     MODRR2_MODRR21
#define PTSRR_PTSRR2                     MODRR2_MODRR22
#define PTSRR_PTSRR3                     MODRR2_MODRR23
#define PTSRR_PTSRR4                     MODRR2_MODRR24
#define PTSRR_PTSRR5                     MODRR2_MODRR25
#define PTSRR_PTSRR7                     MODRR2_MODRR27
#define PTSRR_PTSRR                      MODRR2_MODRR_20
#define PTSRR_PTSRR0_MASK                MODRR2_MODRR20_MASK
#define PTSRR_PTSRR1_MASK                MODRR2_MODRR21_MASK
#define PTSRR_PTSRR2_MASK                MODRR2_MODRR22_MASK
#define PTSRR_PTSRR3_MASK                MODRR2_MODRR23_MASK
#define PTSRR_PTSRR4_MASK                MODRR2_MODRR24_MASK
#define PTSRR_PTSRR5_MASK                MODRR2_MODRR25_MASK
#define PTSRR_PTSRR7_MASK                MODRR2_MODRR27_MASK
#define PTSRR_PTSRR_MASK                 MODRR2_MODRR_20_MASK
#define PTSRR_PTSRR_BITNUM               MODRR2_MODRR_20_BITNUM


/* **** 20/12/2012  */

#define LPSLRSTR                        This_symb_has_been_depreciated
#define LPSLR_LPSLR                     This_symb_has_been_depreciated
#define LPSLR_LPSLRWD                   This_symb_has_been_depreciated
#define LPSLR_LPSLR_MASK                This_symb_has_been_depreciated
#define LPSLR_LPSLR_BITNUM              This_symb_has_been_depreciated
#define LPSLR_LPSLRWD_MASK              This_symb_has_been_depreciated
#define LPSR_LPOC                       This_symb_has_been_depreciated
#define LPSR_LPOC_MASK                  This_symb_has_been_depreciated

#ifndef __V30COMPATIBLE__
#pragma OPTION DEL V30toV31Compatible
#endif
/*lint -restore  +esym(960,18.4) +esym(961,19.7) Enable MISRA rule (1.1,18.4,6.4,19.7) checking. */
#endif
